Αρχικές προδιαγραφές
-----------------------------
Η ιδέα είναι να βγαίνει αυτόματα ένα πρόγραμμα βάση των εντολών που δίνουμε. Π.χ.
•	Να καλύπτονται όλοι οι βάρδιες με 2 απόγευμα και 2 νύχτα
•	Τα πρωινά να υπάρχουν πάντα 3 άτομα (εκτός Προϊσταμένου και Υπευθύνου)
•	Να λαμβάνει υπόψη όλες τις ημέρες της εφημερίας να μην μπαίνουν απόγευμα-νύχτα οι ίδιοι νοσηλευτές
•	Τα Σ/Κ- Έξω να είναι δίκαια για όλους τους νοσηλευτές
•	Να έχει μνήμη να θυμάται τις περσινές βάρδιες  (π.χ. εάν κάποιος ήταν έξω πέρυσι το Πάσχα φέτος να είναι μέσα)
•	Να λαμβάνει υπόψη ότι θα πρέπει να δοθούν οι κανονικές άδειες (28 ημέρες το χρόνο)
•	Να προγραμματίζει τις καλοκαιρινές άδειες
•	Να δέχεται πεδία παρέμβασης από τον/ην Προϊστάμενο/νη 
•	Να έχει άλλες εναλλακτικές επιλογές.

